{
  "job-app": [
    {
      "company": "babylon",
      "jobTitle": "front end software engineer",
      "location": "Austin, TX",
      "status": "Application Submitted",
      "webpage": "https://jobs.lever.co/babylonhealth/d6a4e5ea-f513-424d-bd9c-7eebe1f0da7c?lever-source=LinkedInJobs",
      "description": "The role\n\nBabylon is a healthtech company that is going to disrupt the healthcare industry by creating an AI / Digital first platform to re-invent how healthcare is delivered for the better.  \n\nIn your role as a Front End Engineer, you will have an opportunity to develop seamless applications to drive rich experiences for our end users at scale.  We are developing React (web based applications) and React Native (mobile applications).   \n\n\nTech Stack \n\nReact, React Native, Redux, GraphQL\nCOOL PROJECTS WE ARE WORKING ON\nClinical portal - Babylon provides the most efficient and high-quality interfaces for our clinicians to use when they are consulting, preparing and following-up with a patient. A fluid, fast UI is key to patient quality and efficiency. We’ve built a highly-composable component-based system in React and are continually enhancing useability and performance.\nReact Native platform - we’re moving to the React Native platform for developing apps and are blazing a trail for modern React Native development with our platform providing micro frontend, design and release capabilities. Our React Native experiences are packaged into multiple apps around the globe, we use rich data and behavioural insights to drive better access to healthcare through our mobile apps.\nWeb platform - we’re changing the way that web is thought about at Babylon through a new platform that provides our teams support for micro frontends, design systems, analytics, test and release out-of-the-box\nBehavioral data loops - our business depends on rich streams of data to optimize for patient experience and healthcare outcomes. We empower product teams by providing behavioural data loops as a service.\nWearables and labs sync - our mobile apps connect to patient wearables and lab results to let patients take control of their own healthcare, and understand what the next best thing they can do to improve their health is.\nREQUIREMENTS\nYou’re a keen front-end engineer with a great knowledge of modern Javascript and / or Typescript\nYou know React (or another modern framework) and are keen to learn and use React and React Native\nYou’re passionate about the web, Android and iOS surfaces\nYou have or want to build a great knowledge of GraphQL, Apollo Client & Services and Apollo Federation\nYou love to test and know tools like Jest, Detox, Appium and Cypress for testing\nYou’re interested in full-stack modern & secure cloud development and are comfortable diving into back-end code to find a bug or assist another engineer\nTechnology is your strength but you’ll bring more than just your technical expertise to the table - you’re obsessed with our users and helping them achieve better health outcomes - and you care deeply about every step of their healthcare journey",
      "id": 1
    },
    {
      "company": "1",
      "id": 2
    }
  ]
}